# AnalyticalModelWallBaseProjection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalModelWallBaseProjection Property
ParameterTypeId Class See Also
---
"Base y Projection"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalModelWallBaseProjection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalModelWallBaseProjection As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalModelWallBaseProjection {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace